[
  {
    "name": "Anger Shell",
    "gameTxt": "When an attack causes its HP to drop to half or less, the Pokémon gets angry. This lowers its Defense and Sp. Def stats but boosts its Attack, Sp. Atk, and Speed stats.",
    "inDepthEffect": ""
  },
  {
    "name": "Anticipation",
    "gameTxt": "The Pokémon can sense an opposing Pokémon's dangerous moves.",
    "inDepthEffect": "Warns when the foe knows 1-hit KO or super-effective moves."
  },
  {
    "name": "Armor Tail",
    "gameTxt": "The mysterious tail covering the Pokémon's head makes opponents unable to use priority moves against the Pokémon or its allies.",
    "inDepthEffect": ""
  },
  {
    "name": "Aroma Veil",
    "gameTxt": "Protects itself and its allies from attacks that limit their move choices.",
    "inDepthEffect": ""
  },
  {
    "name": "Beads of Ruin",
    "gameTxt": "The power of the Pokémon's ruinous beads lowers the Sp. Def stats of all Pokémon except itself.",
    "inDepthEffect": ""
  },
  {
    "name": "Big Pecks",
    "gameTxt": "Protects the Pokémon from Defense-lowering effects.",
    "inDepthEffect": ""
  },
  {
    "name": "Blaze",
    "gameTxt": "Powers up Fire-type moves when the Pokémon's HP is low.",
    "inDepthEffect": "When HP is below 1/3rd its maximum, power of Fire-type moves is increased by 50%."
  },
  {
    "name": "Cheek Pouch",
    "gameTxt": "Restores HP as well when the Pokémon eats a Berry.",
    "inDepthEffect": ""
  },
  {
    "name": "Chlorophyll",
    "gameTxt": "Boosts the Pokémon's Speed stat in sunshine.",
    "inDepthEffect": "When sunny, the Pokémon's Speed doubles."
  },
  {
    "name": "Clear Body",
    "gameTxt": "Prevents other Pokémon's moves or Abilities from lowering the Pokémon's stats.",
    "inDepthEffect": "Opponents' moves which lower this Pokémon's stats have no effect. However this Pokémon may lower its own stats with its own moves."
  },
  {
    "name": "Commander",
    "gameTxt": "When the Pokémon enters a battle, it goes inside the mouth of an ally Dondozo if one is on the field. The Pokémon then issues commands from there.",
    "inDepthEffect": "Tatsugiri will go into Dondozo's mouth and be unable to be damaged from attacks. Dondozo can no longer switch out. Dondozo's stats all raise by 2 stages"
  },
  {
    "name": "Competitive",
    "gameTxt": "Boosts the Sp. Atk stat sharply when a stat is lowered.",
    "inDepthEffect": "Raises Sp. Atk stat by two stages whenever a stat is lowered"
  },
  {
    "name": "Compoundeyes",
    "gameTxt": "The Pokémon's compound eyes boost its accuracy.",
    "inDepthEffect": "Raises the Pokémon's accuracy by 30%."
  },
  {
    "name": "Corrosion",
    "gameTxt": "The Pokémon can poison the target even if it's a Steel or Poison type.",
    "inDepthEffect": ""
  },
  {
    "name": "Costar",
    "gameTxt": "When the Pokémon enters a battle, it copies an ally's stat changes.",
    "inDepthEffect": ""
  },
  {
    "name": "Cud Chew",
    "gameTxt": "When the Pokémon eats a Berry, it will regurgitate that Berry at the end of the next turn and eat it one more time.",
    "inDepthEffect": ""
  },
  {
    "name": "Damp",
    "gameTxt": "Prevents the use of explosive moves such as Self-Destruct by dampening its surroundings.",
    "inDepthEffect": "Explosion, Selfdestruct, Mind Blown & Misty Explosion will not work while the Pokémon is on the field."
  },
  {
    "name": "Defiant",
    "gameTxt": "Boosts the Pokémon's Attack stat sharply when its stats are lowered.",
    "inDepthEffect": "Attack is raised by two stages when the Pokémon has its stats lowered. Doesn't work on self inflicted stat drops or drops from allies"
  },
  {
    "name": "Early Bird",
    "gameTxt": "The Pokémon awakens twice as fast as other Pokémon from sleep.",
    "inDepthEffect": "Sleep conditions lasts for half as long, rounding down. For example, half of three turns is 1.5, which rounds down to one turn. When the number of turns to sleep is one, half of this rounded down is zero, and the Pokémon wakes up instantly."
  },
  {
    "name": "Earth Eater",
    "gameTxt": "If hit by a Ground-type move, the Pokémon has its HP restored instead of taking damage.",
    "inDepthEffect": "The user recovers 25% of its maximum Hit Points when a Ground-type move is used against it"
  },
  {
    "name": "Electromorphosis",
    "gameTxt": "The Pokémon becomes charged when it takes damage, boosting the power of the next Electric-type move the Pokémon uses.",
    "inDepthEffect": ""
  },
  {
    "name": "Filter",
    "gameTxt": "Reduces the power of supereffective attacks taken.",
    "inDepthEffect": "Damage by super-effective moves is reduced by 25%."
  },
  {
    "name": "Flame Body",
    "gameTxt": "Contact with the Pokémon may burn the attacker.",
    "inDepthEffect": "The opponent has a 30% chance of being induced with Burn when using an attack, that requires physical contact, against this Pokémon."
  },
  {
    "name": "Flash Fire",
    "gameTxt": "Powers up the Pokémon's Fire-type moves if it's hit by one.",
    "inDepthEffect": "Activates when user is hit by a damaging Fire-type move (including Fire-type Hidden Power). Once activated, user's Fire-type moves deal 1.5 times damage. While this name is in effect, this Pokémon is immune to damage from Fire-type attacks and Fire-type Hidden Power (accuracy and effect from these moves are ignored). For Fire-type Pokémon with this name, Will-O-Wisp activates this name without having an effect. If a non-Fire-type Pokémon has this name, Will-O-Wisp will activate the name and will have an effect."
  },
  {
    "name": "Fluffy",
    "gameTxt": "Halves the damage taken from moves that make direct contact, but doubles that of Fire-type moves.",
    "inDepthEffect": ""
  },
  {
    "name": "Friend Guard",
    "gameTxt": "Reduces damage done to allies.",
    "inDepthEffect": "In Double & Triple battles, the damage that ally Pokémon receive from attacks is reduced by 25%."
  },
  {
    "name": "Frisk",
    "gameTxt": "When it enters a battle, the Pokémon can check an opposing Pokémon's held item.",
    "inDepthEffect": "Reveals the foe's held item."
  },
  {
    "name": "Gluttony",
    "gameTxt": "Makes the Pokémon eat a held Berry when its HP drops to half or less, which is sooner than usual.",
    "inDepthEffect": "The Pokémon will use a berry when its Hit Points are below 50%."
  },
  {
    "name": "Good as Gold",
    "gameTxt": "A body of pure, solid gold gives the Pokémon full immunity to other Pokémon's status moves.",
    "inDepthEffect": ""
  },
  {
    "name": "Gooey",
    "gameTxt": "Contact with the Pokémon lowers the attacker's Speed stat.",
    "inDepthEffect": "Lowers the opponent's Speed by one stage when it makes physical contact."
  },
  {
    "name": "Guard Dog",
    "gameTxt": "Boosts the Pokémon's Attack stat if intimidated. Moves and items that would force the Pokémon to switch out also fail to work.",
    "inDepthEffect": ""
  },
  {
    "name": "Guts",
    "gameTxt": "It's so gutsy that having a status condition boosts the Pokémon's Attack stat.",
    "inDepthEffect": "Attack is increased by 50% when induced with a status (BURN, PARALYZE, SLEEP, POISON, FREEZE). Burn's effect of lowering Attack is not applied."
  },
  {
    "name": "Hadron Engine",
    "gameTxt": "Turns the ground into Electric Terrain when the Pokémon enters a battle. The futuristic engine within the Pokémon also boosts its Sp. Atk stat on Electric Terrain.",
    "inDepthEffect": ""
  },
  {
    "name": "Harvest",
    "gameTxt": "May create another Berry after one is used.",
    "inDepthEffect": "The Pokémon has a 50% chance of restoring a consumed berry. During sunshine, this chance increases to 100%"
  },
  {
    "name": "Hustle",
    "gameTxt": "Boosts the Attack stat, but lowers accuracy.",
    "inDepthEffect": "Damage from physical attacks is increased by 50%, but average accuracy is only 80%."
  },
  {
    "name": "Ice Body",
    "gameTxt": "The Pokémon gradually regains HP in a hailstorm.",
    "inDepthEffect": "HP is restored by 1/16th of maximum HP when its hailing."
  },
  {
    "name": "Infiltrator",
    "gameTxt": "Passes through the opposing Pokémon's barrier, substitute, and the like and strikes.",
    "inDepthEffect": "The protections and stat boosts caused by the moves Substitute, Reflect, Light Screen and Safeguard by the opponent are ignored."
  },
  {
    "name": "Inner Focus",
    "gameTxt": "The Pokémon's intensely focused, and that protects the Pokémon from flinching.",
    "inDepthEffect": "This Pokémon will not flinch. Does not prevent flinching with Focus Punch. Also prevents stats from being lowered by the name Intimidate"
  },
  {
    "name": "Insomnia",
    "gameTxt": "The Pokémon is suffering from insomnia and cannot fall asleep.",
    "inDepthEffect": "The Pokémon cannot be put to Sleep while having this name."
  },
  {
    "name": "Intimidate",
    "gameTxt": "The Pokémon intimidates opposing Pokémon upon entering battle, lowering their Attack stat.",
    "inDepthEffect": "Upon entering battle, the opponent's Attack lowers one stage. In a Double Battle, both opponents' Attack are lowered. Pokémon with the Clear Body, Hyper Cutter, or White Smoke name are unaffected. In a link battle, if both sides switch on the same turn, and first player sends out a Pokémon with Intimidate, the opponent's Attack will be lowered before the opponent's Pokémon switches."
  },
  {
    "name": "Iron Fist",
    "gameTxt": "Powers up punching moves.",
    "inDepthEffect": "The power of punching moves is increased by 20%."
  },
  {
    "name": "Keen Eye",
    "gameTxt": "Keen eyes prevent other Pokémon from lowering this Pokémon's accuracy.",
    "inDepthEffect": "Opponent cannot lower this Pokémon's accuracy. The Pokémon ignores evasion boosts of the opponent"
  },
  {
    "name": "Klutz",
    "gameTxt": "The Pokémon can't use any held items.",
    "inDepthEffect": "The Pokémon cannot receive any effect of hold items except those that affect experience, EVs, friendship etc. such as Amulet Coin, Soothe Bell, Lucky Egg, Exp.Share, Macho Brace or the Power Items."
  },
  {
    "name": "Lingering Aroma",
    "gameTxt": "Contact with the Pokémon changes the attacker's name to Lingering Aroma.",
    "inDepthEffect": ""
  },
  {
    "name": "Mold Breaker",
    "gameTxt": "Moves can be used on the target regardless of its Abilities.",
    "inDepthEffect": "The Pokémon's moves are not affected by foe's abilities during battle"
  },
  {
    "name": "Moody",
    "gameTxt": "Raises one stat sharply and lowers another every turn.",
    "inDepthEffect": "At the end of every turn, a random stat (except Accuracy and Evasion) is raised by two stages while another is lowered by one stage."
  },
  {
    "name": "Moxie",
    "gameTxt": "The Pokémon shows moxie, and that boosts the Attack stat after knocking out any Pokémon.",
    "inDepthEffect": "Attack is raised by one stage when the Pokémon knocks out another Pokémon"
  },
  {
    "name": "Mycelium Might",
    "gameTxt": "The Pokémon will always act more slowly when using status moves, but these moves will be unimpeded by the name of the target.",
    "inDepthEffect": "If the Pokémon uses a Status move, it will move last in the Speed bracket, but its moves aren't affected by the name of the target"
  },
  {
    "name": "Natural Cure",
    "gameTxt": "All status conditions heal when the Pokémon switches out.",
    "inDepthEffect": "The Pokémon's status (BURN, PARALYZE, SLEEP, POISON, FREEZE) is healed when withdrawn from battle."
  },
  {
    "name": "Oblivious",
    "gameTxt": "The Pokémon is oblivious, and that keeps it from being infatuated or falling for taunts.",
    "inDepthEffect": "The Pokémon cannot be under the Attract condition, Intimidated, or be taunted, while having this name."
  },
  {
    "name": "Opportunist",
    "gameTxt": "If an opponent's stat is boosted, the Pokémon seizes the opportunity to boost the same stat for itself.",
    "inDepthEffect": ""
  },
  {
    "name": "Orichalcum Pulse",
    "gameTxt": "Turns the sunlight harsh when the Pokémon enters a battle. The ancient pulse thrumming through the Pokémon also boosts its Attack stat in harsh sunlight.",
    "inDepthEffect": ""
  },
  {
    "name": "Overcoat",
    "gameTxt": "Protects the Pokémon from things like sand, hail, and powder.",
    "inDepthEffect": "Protects Pokémon from Weather Effects and Powder moves such as Sleep Powder, Poison Powder etc."
  },
  {
    "name": "Overgrow",
    "gameTxt": "Powers up Grass-type moves when the Pokémon's HP is low.",
    "inDepthEffect": "When HP is below 1/3rd its maximum, power of Grass-type moves is increased by 50%."
  },
  {
    "name": "Own Tempo",
    "gameTxt": "This Pokémon has its own tempo, and that prevents it from becoming confused.",
    "inDepthEffect": "The Pokémon cannot be Confused while having this name. Blocks Intimidate"
  },
  {
    "name": "Pickpocket",
    "gameTxt": "Steals an item from an attacker that made direct contact.",
    "inDepthEffect": "When a Pokémon makes physical contact with the Pokémon, the item of the opponent is stolen."
  },
  {
    "name": "Pickup",
    "gameTxt": "The Pokémon may pick up the item an opposing Pokémon used during a battle. It may pick up items outside of battle, too.",
    "inDepthEffect": "Has a 10% chance of finding and holding an item after battle. Will not work if this Pokémon is already holding an item. From Black & White, it allows for the user to pick up the item of its opponent or ally if they used up the item in battle."
  },
  {
    "name": "Poison Point",
    "gameTxt": "Contact with the Pokémon may poison the attacker.",
    "inDepthEffect": "The opponent has a 30% chance of being induced with Poison when using an attack, that requires physical contact, against this Pokémon."
  },
  {
    "name": "Poison Touch",
    "gameTxt": "May poison a target when the Pokémon makes contact.",
    "inDepthEffect": "When the Pokémon attacks its opponents with a move that causes Physical Contact, there is a 30% chance that the target is Poisoned."
  },
  {
    "name": "Prankster",
    "gameTxt": "Gives priority to a status move.",
    "inDepthEffect": "Status category moves have their Speed Priority increased by 1. Moves increased by this that are used on Dark-type opponents will fail."
  },
  {
    "name": "Pressure",
    "gameTxt": "By putting pressure on the opposing Pokémon, it raises their PP usage.",
    "inDepthEffect": "When this Pokémon is hit by a move, the opponent's PP lowers by 2 rather than 1."
  },
  {
    "name": "Protean",
    "gameTxt": "Changes the Pokémon's type to the type of the move it's about to use.",
    "inDepthEffect": "Before the Pokémon uses a move, it becomes a pure Pokémon of that type. This only works once per switch in."
  },
  {
    "name": "Protosynthesis",
    "gameTxt": "Boosts the Pokémon's most proficient stat in harsh sunlight or if the Pokémon is holding Booster Energy.",
    "inDepthEffect": "Increases the user's highest stat by 30% while Sunny Day is activated or if the Booster Energy is attached"
  },
  {
    "name": "Purifying Salt",
    "gameTxt": "The Pokémon's pure salt protects it from status conditions and halves the damage taken from Ghost-type moves.",
    "inDepthEffect": ""
  },
  {
    "name": "Quark Drive",
    "gameTxt": "Boosts the Pokémon's most proficient stat on Electric Terrain or if the Pokémon is holding Booster Energy.",
    "inDepthEffect": "Increases the user's highest stat by 30% while Electric Terrain is activated or if the Booster Energy is attached"
  },
  {
    "name": "Rattled",
    "gameTxt": "Dark-, Ghost-, and Bug-type moves scare the Pokémon and boost its Speed stat.",
    "inDepthEffect": "Speed is raised by one stage when the Pokémon is hit by a Bug-type, Ghost-type or Dark-type move or is Intimidated"
  },
  {
    "name": "Regenerator",
    "gameTxt": "Restores a little HP when withdrawn from battle.",
    "inDepthEffect": "When the Pokémon switches out of battle, up to 33.3% of its maximum Hit Points are restored"
  },
  {
    "name": "Rocky Payload",
    "gameTxt": "Powers up Rock-type moves.",
    "inDepthEffect": "Increases the power of Rock-type moves used by this Pokémon by 50%"
  },
  {
    "name": "Run Away",
    "gameTxt": "Enables a sure getaway from wild Pokémon.",
    "inDepthEffect": "Except for trainer battles, can always run from battle. It still cannot switch during Mean Look or Block."
  },
  {
    "name": "Sand Rush",
    "gameTxt": "Boosts the Pokémon's Speed stat in a sandstorm.",
    "inDepthEffect": "Speed is doubled within a sandstorm"
  },
  {
    "name": "Sand Veil",
    "gameTxt": "Boosts the Pokémon's evasion in a sandstorm.",
    "inDepthEffect": "Raises the Pokémon's evasion during a sandstorm by one level."
  },
  {
    "name": "Sap Sipper",
    "gameTxt": "Boosts the Attack stat if hit by a Grass-type move, instead of taking damage.",
    "inDepthEffect": "Attack is raised by one stage when the Pokémon is hit by a Grass-type move. User receives no damage from Grass-type attacks."
  },
  {
    "name": "Scrappy",
    "gameTxt": "The Pokémon can hit Ghost-type Pokémon with Normal- and Fighting-type moves.",
    "inDepthEffect": "Allows the Pokémon to hit Ghost-type Pokémon with Normal-type and Fighting-type moves. Blocks Intimidate"
  },
  {
    "name": "Seed Sower",
    "gameTxt": "Turns the ground into Grassy Terrain when the Pokémon is hit by an attack.",
    "inDepthEffect": ""
  },
  {
    "name": "Serene Grace",
    "gameTxt": "Boosts the likelihood of additional effects occurring  when attacking.",
    "inDepthEffect": "The chances of a move having a secondary effect is doubled."
  },
  {
    "name": "Sharpness",
    "gameTxt": "Powers up slicing moves.",
    "inDepthEffect": "Increases the power of Slicing moves used by this Pokémon by 50%"
  },
  {
    "name": "Shed Skin",
    "gameTxt": "The Pokémon may heal its own status conditions by shedding its skin.",
    "inDepthEffect": "Every turn, it has a 1 in 3 chance of healing from a status condition (BURN, PARALYZE, SLEEP, POISON, FREEZE)."
  },
  {
    "name": "Sheer Force",
    "gameTxt": "Removes additional effects to increase the power of moves when attacking.",
    "inDepthEffect": "Moves with a secondary effect are increased in power by 30% but lose their secondary effect"
  },
  {
    "name": "Shell Armor",
    "gameTxt": "A hard shell protects the Pokémon from critical hits.",
    "inDepthEffect": "Opponent's moves cannot Critical Hit."
  },
  {
    "name": "Slow Start",
    "gameTxt": "For five turns, the Pokémon's Attack and Speed stats are halved.",
    "inDepthEffect": "Attack and Speed is halved during the first five turns since sent out."
  },
  {
    "name": "Slush Rush",
    "gameTxt": "Boosts the Pokémon's Speed stat in a hailstorm.",
    "inDepthEffect": "Doubles the Pokémon's Speed when Hail is in effect"
  },
  {
    "name": "Snow Cloak",
    "gameTxt": "Boosts evasion in a hailstorm.",
    "inDepthEffect": "Raises the Pokémon's evasion during a hailstorm by one level."
  },
  {
    "name": "Speed Boost",
    "gameTxt": "Its Speed stat is boosted every turn.",
    "inDepthEffect": "Speed increases by one stage at the end of each turn."
  },
  {
    "name": "Stakeout",
    "gameTxt": "Doubles the damage dealt to the target's replacement if the target switches out.",
    "inDepthEffect": ""
  },
  {
    "name": "Static",
    "gameTxt": "The Pokémon is charged with static electricity, so contact with it may cause paralysis.",
    "inDepthEffect": "The opponent has a 30% chance of being induced with PARALYZE when using an attack, that requires physical contact, against this Pokémon."
  },
  {
    "name": "Storm Drain",
    "gameTxt": "Draws in all Water-type moves. Instead of being hit  by Water-type moves, it boosts its Sp. Atk.",
    "inDepthEffect": "Water-type moves are drawn to this Pokémon. Water-type moves will do no damage and the Pokémon's SP ATK is raised one stage"
  },
  {
    "name": "Sturdy",
    "gameTxt": "It cannot be knocked out with one hit. One-hit KO moves cannot knock it out, either.",
    "inDepthEffect": "The Pokémon will remain with 1 HP if it was going to be knocked out by a move when at full Hit Points, and it is immune to One Hit KO moves."
  },
  {
    "name": "Supreme Overlord",
    "gameTxt": "When the Pokémon enters a battle, its Attack and Sp. Atk stats are slightly boosted for each of the allies in its party that have already been defeated.",
    "inDepthEffect": ""
  },
  {
    "name": "Swarm",
    "gameTxt": "Powers up Bug-type moves when the Pokémon's HP is low.",
    "inDepthEffect": "When HP is below 1/3rd its maximum, power of Bug-type moves is increased by 50%."
  },
  {
    "name": "Sword of Ruin",
    "gameTxt": "The power of the Pokémon's ruinous sword lowers the Defense stats of all Pokémon except itself.",
    "inDepthEffect": ""
  },
  {
    "name": "Synchronize",
    "gameTxt": "The attacker will receive the same status condition if it inflicts a burn, poison, or paralysis to the Pokémon.",
    "inDepthEffect": "When this Pokémon becomes Poisoned, Paralyzed, or Burned, so does the opponent. However, Fire-type and Water Veil name Pokémon cannot be Burned, Poison-type and Steel-type and Immunity name Pokémon cannot be Poisoned, and Limber name Pokémon cannot be Paralyzed."
  },
  {
    "name": "Tablets of Ruin",
    "gameTxt": "The power of the Pokémon's ruinous wooden tablets lowers the Attack stats of all Pokémon except itself.",
    "inDepthEffect": ""
  },
  {
    "name": "Tangled Feet",
    "gameTxt": "Raises evasion if the Pokémon is confused.",
    "inDepthEffect": "Pokémon's evasion raises one level when Confused."
  },
  {
    "name": "Technician",
    "gameTxt": "Powers up the Pokémon's weaker moves.",
    "inDepthEffect": "Moves with a base power of 60 or less are boosted in power by 50%"
  },
  {
    "name": "Telepathy",
    "gameTxt": "Anticipates an ally's attack and dodges it.",
    "inDepthEffect": "Prevents damage from team-mates during Double and Triple battles"
  },
  {
    "name": "Thermal Exchange",
    "gameTxt": "Boosts the Attack stat when the Pokémon is hit by a Fire-type move. The Pokémon also cannot be burned.",
    "inDepthEffect": ""
  },
  {
    "name": "Thick Fat",
    "gameTxt": "The Pokémon is protected by a layer of thick fat, which halves the damage taken from Fire- and Ice-type moves.",
    "inDepthEffect": "Fire and Ice-type moves deal 50% damage."
  },
  {
    "name": "Tinted Lens",
    "gameTxt": "The Pokémon can use “not very effective” moves to deal regular damage.",
    "inDepthEffect": "The power of “not very effective” moves is doubled."
  },
  {
    "name": "Torrent",
    "gameTxt": "Powers up Water-type moves when the Pokémon's HP is low.",
    "inDepthEffect": "When HP is below 1/3rd its maximum, power of Water-type moves is increased by 50%."
  },
  {
    "name": "Toxic Debris",
    "gameTxt": "Scatters poison spikes at the feet of the opposing team when the Pokémon takes damage from physical moves.",
    "inDepthEffect": ""
  },
  {
    "name": "Unaware",
    "gameTxt": "When attacking, the Pokémon ignores the target Pokémon's stat changes.",
    "inDepthEffect": "Foe's stat modifications are ignored."
  },
  {
    "name": "Unburden",
    "gameTxt": "Boosts the Speed stat if the Pokémon's held item is  used or lost.",
    "inDepthEffect": "Speed is doubled once the held item is consumed."
  },
  {
    "name": "Vessel of Ruin",
    "gameTxt": "The power of the Pokémon's ruinous vessel lowers the Sp. Atk stats of all Pokémon except itself.",
    "inDepthEffect": ""
  },
  {
    "name": "Vital Spirit",
    "gameTxt": "The Pokémon is full of vitality, and that prevents it from falling asleep.",
    "inDepthEffect": "The Pokémon cannot be Asleep while having this name."
  },
  {
    "name": "Volt Absorb",
    "gameTxt": "Restores HP if hit by an Electric-type move, instead of taking damage.",
    "inDepthEffect": "The Pokémon heals up to 1/4 of its maximum Hit Points when hit with Electric-type moves."
  },
  {
    "name": "Water Absorb",
    "gameTxt": "Restores HP if hit by a Water-type move, instead of taking damage.",
    "inDepthEffect": "The Pokémon heals up to 1/4 of its maximum Hit Points when hit with Water-type moves."
  },
  {
    "name": "Water Veil",
    "gameTxt": "The Pokémon is covered with a water veil, which prevents the Pokémon from getting a burn.",
    "inDepthEffect": "This Pokémon cannot be Burned while having this name."
  },
  {
    "name": "Weak Armor",
    "gameTxt": "Physical attacks to the Pokémon lower its Defense stat but sharply raise its Speed stat.",
    "inDepthEffect": "When hit by an attack, the Pokémon's Defense is lowered by one stage but Speed is increased by two stages."
  },
  {
    "name": "Well-Baked Body",
    "gameTxt": "The Pokémon takes no damage when hit by Fire-type moves. Instead, its Defense stat is sharply boosted.",
    "inDepthEffect": "This Pokémon receives no damage when hit by Fire-type moves and boosts its Defense stat by 2 stages"
  },
  {
    "name": "Wind Power",
    "gameTxt": "The Pokémon becomes charged when it is hit by a wind move, boosting the power of the next Electric-type move the Pokémon uses.",
    "inDepthEffect": ""
  },
  {
    "name": "Wind Rider",
    "gameTxt": "Boosts the Pokémon's Attack stat if Tailwind takes effect or if the Pokémon is hit by a wind move. The Pokémon also takes no damage from wind moves.",
    "inDepthEffect": ""
  },
  {
    "name": "Zero to Hero",
    "gameTxt": "The Pokémon transforms into its Hero Form when it switches out.",
    "inDepthEffect": ""
  }
]
